In [1]:
import pandas as pd

In [2]:
visits = pd.read_csv('C:/Users\/juanm/Escritorio/Juanmi/DataFest IKEA/Team 09. ImportBilly/1. Data/visits_train.csv', parse_dates=[1])
pred = pd.read_csv('C:/Users\/juanm/Escritorio/Juanmi/DataFest IKEA/Team 09. ImportBilly/1. Data/pred.csv', parse_dates=[1])

C:\Users\juanm\AppData\Local\Temp\ipykernel_30880\924066995.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  visits = pd.read_csv('C:/Users\/juanm/Escritorio/Juanmi/DataFest IKEA/Team 09. ImportBilly/1. Data/visits_train.csv', parse_dates=[1])

In [3]:
visits.head()

  location date_visit     visits
0   Madrid 2023-02-28  67.323720
1   Madrid 2023-02-27  71.894430
2   Madrid 2023-02-26  87.803810
3   Madrid 2023-02-25  90.435243
4   Madrid 2023-02-24  76.281122

In [4]:
pred.head()

          location_date             visits
0  Barcelona_2023-03-01  60.93174867083918
1  Barcelona_2023-03-02  58.83275117009444
2  Barcelona_2023-03-03  61.56542241442856
3  Barcelona_2023-03-04  77.99638690508833
4  Barcelona_2023-03-05  54.37425342948702

In [5]:
pred[['location', 'date_visit']] = pred['location_date'].str.split('_', expand=True, )

In [6]:
pred.head()

          location_date             visits   location  date_visit
0  Barcelona_2023-03-01  60.93174867083918  Barcelona  2023-03-01
1  Barcelona_2023-03-02  58.83275117009444  Barcelona  2023-03-02
2  Barcelona_2023-03-03  61.56542241442856  Barcelona  2023-03-03
3  Barcelona_2023-03-04  77.99638690508833  Barcelona  2023-03-04
4  Barcelona_2023-03-05  54.37425342948702  Barcelona  2023-03-05

In [7]:
pred = pred.drop('location_date', axis=1)

In [8]:
pred.head()

              visits   location  date_visit
0  60.93174867083918  Barcelona  2023-03-01
1  58.83275117009444  Barcelona  2023-03-02
2  61.56542241442856  Barcelona  2023-03-03
3  77.99638690508833  Barcelona  2023-03-04
4  54.37425342948702  Barcelona  2023-03-05

In [10]:
pred.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   visits      62 non-null     object
 1   location    62 non-null     object
 2   date_visit  62 non-null     object
dtypes: object(3)
memory usage: 1.6+ KB

In [11]:
visits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    1338 non-null   object
 1   date_visit  1338 non-null   datetime64[ns]
 2   visits      1338 non-null   float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 31.5+ KB

In [12]:
pred['visits'] = pred['visits'].astype(float)

In [13]:
pred.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   visits      62 non-null     float64
 1   location    62 non-null     object
 2   date_visit  62 non-null     object
dtypes: float64(1), object(2)
memory usage: 1.6+ KB

In [14]:
pred['date_visit'] = pd.to_datetime(pred['date_visit'])

In [15]:
pred.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   visits      62 non-null     float64
 1   location    62 non-null     object
 2   date_visit  62 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 1.6+ KB

In [16]:
pred.head()

      visits   location date_visit
0  60.931749  Barcelona 2023-03-01
1  58.832751  Barcelona 2023-03-02
2  61.565422  Barcelona 2023-03-03
3  77.996387  Barcelona 2023-03-04
4  54.374253  Barcelona 2023-03-05

In [17]:
visits.head()

  location date_visit     visits
0   Madrid 2023-02-28  67.323720
1   Madrid 2023-02-27  71.894430
2   Madrid 2023-02-26  87.803810
3   Madrid 2023-02-25  90.435243
4   Madrid 2023-02-24  76.281122

In [19]:
df_final = pd.concat([visits, pred], axis=0)

In [20]:
df_final

   location date_visit     visits
0    Madrid 2023-02-28  67.323720
1    Madrid 2023-02-27  71.894430
2    Madrid 2023-02-26  87.803810
3    Madrid 2023-02-25  90.435243
4    Madrid 2023-02-24  76.281122
..      ...        ...        ...
57   Madrid 2023-03-27  75.546072
58   Madrid 2023-03-28  75.169314
59   Madrid 2023-03-29  73.304700
60   Madrid 2023-03-30  74.240915
61   Madrid 2023-03-31  74.368482

[1400 rows x 3 columns]

In [26]:
df_final.to_csv('C:/Users\/juanm/Escritorio/Juanmi/DataFest IKEA/Team 09. ImportBilly/1. Data/visits_pred.csv', index=False, date_format='%Y-%m-%d')

In [27]:
df_final.tail()

   location date_visit     visits
57   Madrid 2023-03-27  75.546072
58   Madrid 2023-03-28  75.169314
59   Madrid 2023-03-29  73.304700
60   Madrid 2023-03-30  74.240915
61   Madrid 2023-03-31  74.368482